# Rebar Free Form Creation Result Methods

Source: https://www.revitapidocs.com/2026/c85d458a-3c03-2a09-cd1e-2ce0a580dbd3.htm

---

| Rebar Free Form Creation Result Methods |
| --- |

The RebarFreeFormCreationResult type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

RebarFreeFormCreationResult Class Autodesk.Revit.DB.Structure Namespace